#language: ru

@tree
@БыстрыеПроверки

Функциональность: Проверка открытия форм регистров сведений

Контекст:
	Дано Я запускаю сценарий открытия TestClient или подключаю уже существующий
	
Сценарий: Открытие формы списка "AddProperties" 

	Дано Я открываю основную форму списка регистра сведений "AddProperties"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений AddProperties"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "AddProperties"

	Дано Я открываю основную форму регистра сведений "AddProperties"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений AddProperties"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "AttachedFiles" 

	Дано Я открываю основную форму списка регистра сведений "AttachedFiles"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений AttachedFiles"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "AttachedFiles"

	Дано Я открываю основную форму регистра сведений "AttachedFiles"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений AttachedFiles"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Barcodes" 

	Дано Я открываю основную форму списка регистра сведений "Barcodes"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений Barcodes"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Barcodes"

	Дано Я открываю основную форму регистра сведений "Barcodes"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений Barcodes"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "BarcodeScanInfoCheck" 

	Дано Я открываю основную форму списка регистра сведений "BarcodeScanInfoCheck"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений BarcodeScanInfoCheck"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "BarcodeScanInfoCheck"

	Дано Я открываю основную форму регистра сведений "BarcodeScanInfoCheck"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений BarcodeScanInfoCheck"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "BranchBankTerms" 

	Дано Я открываю основную форму списка регистра сведений "BranchBankTerms"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений BranchBankTerms"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "BranchBankTerms"

	Дано Я открываю основную форму регистра сведений "BranchBankTerms"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений BranchBankTerms"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "BundleContents" 

	Дано Я открываю основную форму списка регистра сведений "BundleContents"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений BundleContents"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "BundleContents"

	Дано Я открываю основную форму регистра сведений "BundleContents"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений BundleContents"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "CreatedProcurementOrders" 

	Дано Я открываю основную форму списка регистра сведений "CreatedProcurementOrders"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений CreatedProcurementOrders"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "CreatedProcurementOrders"

	Дано Я открываю основную форму регистра сведений "CreatedProcurementOrders"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений CreatedProcurementOrders"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "CurrencyRates" 

	Дано Я открываю основную форму списка регистра сведений "CurrencyRates"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений CurrencyRates"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "CurrencyRates"

	Дано Я открываю основную форму регистра сведений "CurrencyRates"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений CurrencyRates"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "DataMappingTable" 

	Дано Я открываю основную форму списка регистра сведений "DataMappingTable"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений DataMappingTable"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "DataMappingTable"

	Дано Я открываю основную форму регистра сведений "DataMappingTable"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений DataMappingTable"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ExternalCommands" 

	Дано Я открываю основную форму списка регистра сведений "ExternalCommands"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ExternalCommands"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ExternalCommands"

	Дано Я открываю основную форму регистра сведений "ExternalCommands"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ExternalCommands"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "IDInfo" 

	Дано Я открываю основную форму списка регистра сведений "IDInfo"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений IDInfo"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "IDInfo"

	Дано Я открываю основную форму регистра сведений "IDInfo"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений IDInfo"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "IntegrationInfo" 

	Дано Я открываю основную форму списка регистра сведений "IntegrationInfo"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений IntegrationInfo"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "IntegrationInfo"

	Дано Я открываю основную форму регистра сведений "IntegrationInfo"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений IntegrationInfo"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ItemSegments" 

	Дано Я открываю основную форму списка регистра сведений "ItemSegments"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ItemSegments"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ItemSegments"

	Дано Я открываю основную форму регистра сведений "ItemSegments"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ItemSegments"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "LockDataModificationRules" 

	Дано Я открываю основную форму списка регистра сведений "LockDataModificationRules"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений LockDataModificationRules"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "LockDataModificationRules"

	Дано Я открываю основную форму регистра сведений "LockDataModificationRules"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений LockDataModificationRules"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ObjectStatuses" 

	Дано Я открываю основную форму списка регистра сведений "ObjectStatuses"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ObjectStatuses"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ObjectStatuses"

	Дано Я открываю основную форму регистра сведений "ObjectStatuses"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ObjectStatuses"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "PartnerSegments" 

	Дано Я открываю основную форму списка регистра сведений "PartnerSegments"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений PartnerSegments"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "PartnerSegments"

	Дано Я открываю основную форму регистра сведений "PartnerSegments"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений PartnerSegments"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "PricesByItemKeys" 

	Дано Я открываю основную форму списка регистра сведений "PricesByItemKeys"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений PricesByItemKeys"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "PricesByItemKeys"

	Дано Я открываю основную форму регистра сведений "PricesByItemKeys"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений PricesByItemKeys"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "PricesByItems" 

	Дано Я открываю основную форму списка регистра сведений "PricesByItems"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений PricesByItems"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "PricesByItems"

	Дано Я открываю основную форму регистра сведений "PricesByItems"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений PricesByItems"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "PricesByProperties" 

	Дано Я открываю основную форму списка регистра сведений "PricesByProperties"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений PricesByProperties"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "PricesByProperties"

	Дано Я открываю основную форму регистра сведений "PricesByProperties"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений PricesByProperties"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "RemainingItemsInfo" 

	Дано Я открываю основную форму списка регистра сведений "RemainingItemsInfo"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений RemainingItemsInfo"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "RemainingItemsInfo"

	Дано Я открываю основную форму регистра сведений "RemainingItemsInfo"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений RemainingItemsInfo"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "SavedItems" 

	Дано Я открываю основную форму списка регистра сведений "SavedItems"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений SavedItems"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "SavedItems"

	Дано Я открываю основную форму регистра сведений "SavedItems"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений SavedItems"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "SharedReportOptions" 

	Дано Я открываю основную форму списка регистра сведений "SharedReportOptions"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений SharedReportOptions"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "SharedReportOptions"

	Дано Я открываю основную форму регистра сведений "SharedReportOptions"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений SharedReportOptions"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "T1010S_ScannedBarcode" 

	Дано Я открываю основную форму списка регистра сведений "T1010S_ScannedBarcode"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений T1010S_ScannedBarcode"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "T1010S_ScannedBarcode"

	Дано Я открываю основную форму регистра сведений "T1010S_ScannedBarcode"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений T1010S_ScannedBarcode"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "T2010S_OffsetOfAdvances" 

	Дано Я открываю основную форму списка регистра сведений "T2010S_OffsetOfAdvances"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений T2010S_OffsetOfAdvances"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "T2010S_OffsetOfAdvances"

	Дано Я открываю основную форму регистра сведений "T2010S_OffsetOfAdvances"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений T2010S_OffsetOfAdvances"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "T2011S_PartnerTransactions" 

	Дано Я открываю основную форму списка регистра сведений "T2011S_PartnerTransactions"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений T2011S_PartnerTransactions"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "T2011S_PartnerTransactions"

	Дано Я открываю основную форму регистра сведений "T2011S_PartnerTransactions"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений T2011S_PartnerTransactions"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "T2012S_PartnerAdvances" 

	Дано Я открываю основную форму списка регистра сведений "T2012S_PartnerAdvances"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений T2012S_PartnerAdvances"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "T2012S_PartnerAdvances"

	Дано Я открываю основную форму регистра сведений "T2012S_PartnerAdvances"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений T2012S_PartnerAdvances"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "T2013S_OffsetOfAging" 

	Дано Я открываю основную форму списка регистра сведений "T2013S_OffsetOfAging"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений T2013S_OffsetOfAging"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "T2013S_OffsetOfAging"

	Дано Я открываю основную форму регистра сведений "T2013S_OffsetOfAging"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений T2013S_OffsetOfAging"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Taxes" 

	Дано Я открываю основную форму списка регистра сведений "Taxes"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений Taxes"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Taxes"

	Дано Я открываю основную форму регистра сведений "Taxes"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений Taxes"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "TaxSettings" 

	Дано Я открываю основную форму списка регистра сведений "TaxSettings"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений TaxSettings"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "TaxSettings"

	Дано Я открываю основную форму регистра сведений "TaxSettings"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений TaxSettings"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "UserSettings" 

	Дано Я открываю основную форму списка регистра сведений "UserSettings"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений UserSettings"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "UserSettings"

	Дано Я открываю основную форму регистра сведений "UserSettings"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений UserSettings"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "T3010S_RowIDInfo" 

	Дано Я открываю основную форму списка регистра сведений "T3010S_RowIDInfo"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений T3010S_RowIDInfo"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "T3010S_RowIDInfo"

	Дано Я открываю основную форму регистра сведений "T3010S_RowIDInfo"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений T3010S_RowIDInfo"
	И Я закрываю текущее окно

